app/controllers/students_controller.rb

        def create
            @student = Student.create(students_param(:first_name,:last_name))
---
INSERT INTO "students" ("first_name", "last_name", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["first_name", "carlos"], ["last_name", "danger"], ["created_at", "2020-07-20 06:46:19.142335"], ["updated_at", "2020-07-20 06:46:19.142335"]]

        def update
            @student= Student.find(params[:id])
            @student.update(students_param(:first_name,:last_name))
---
SELECT  "students".* FROM "students" WHERE "students"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
UPDATE "students" SET "first_name" = ?, "last_name" = ?, "updated_at" = ? WHERE "students"."id" = ?  [["first_name", "sales"], ["last_name", "the band"], ["updated_at", "2020-07-20 06:48:31.383207"], ["id", 3]]